{
  "i18n": {
    "commom": {
      "menuOptions": {
        "home": { "text": "Dashboard", "link": "/" },
        "game": { "text": "Play", "link": "/game" },
        "about": { "text": "Rules", "link": "/rules" }
      },
      "footer": {
        "copyrightText": "All rights reserved."
      }
    },
    "home": {
      "gameBanner": {
        "title": "Zignix",
        "subtitle": "Will you accept the challenge?",
        "text": "A game made to test your intelligence. Discover the secret word with as few clues as possible.",
        "buttonText": "Play now"
      },
      "gameSummary": {
        "summaryTitle": "Game summary",
        "resetLevelButtonText": "Reset game",
        "resetModalTitle": "Are you sure you want to restart the game?",
        "resetModalSubtitle": "This action will cause you to lose all saved game progress.",
        "resetModalButtonReset": "Reset",
        "resetModalButtonCancel": "Cancel"
      },
      "doubtBanner": {
        "title": "Access the Complete Guide",
        "subtitle": "and learn everything about the game"
      }
    },
    "game": {
      "playerLevelText": "Level",
      "matchPointsText": "Match points",
      "totalPointsText": "Total points",
      "inputTitle": "Secret word:",
      "inputClearButtonText": "To clean",
      "inputVerifyButtonText": "Check word",
      "inputVerifyButtonLoadingText": "Checking word",
      "cluesTitle": "Clues:",
      "cluesDescription": "You will lose 6.5 points for each clue used.",
      "popupNextLevel": "Congratulations, you got the secret word '%1' right and moved to level %2!",
      "popupWrongSecretWord": "You got the secret word wrong!",
      "gameOver": {
        "gameOverTitle": "Congratulations,",
        "gameOverSubtitle": "you have conquered all stages of the game!",
        "gameOverText": "You demonstrated skill and dexterity by completing each challenge. But the fun doesn't have to stop here! Restart the game to embark on a completely unique experience. With new stages and challenges, you'll have the opportunity to test your skills in even more exciting ways. Get ready to explore new tracks, face new challenges and dive into a renewed adventure! We're excited to see how far you can go. Good luck and have fun!",
        "gameOverResetButtonText": "Start over with new phases"
      }
    },
    "rules": {
      "title": "Complete Guide",
      "ruleList": {
        "1": {
          "title": "Starting the Game",
          "text": "In Zignix, the journey begins at level 1, where players are introduced to the challenge of deciphering secret words. Upon entering the game page, they are greeted with a series of fields, each representing a letter of the secret word. With 100 initial points available, players are ready to face the mystery that awaits."
        },
        "2": {
          "title": "Exploring the Clues",
          "text": "Within Zignix, players have access to 16 mysterious cards, each holding a crucial clue to unravel the secret word. Each card choice implies a loss of 6.5 points from the initial points, so strategy is essential to choose wisely."
        },
        "3": {
          "title": "Unraveling the Secret Word",
          "text": "The core challenge of Zignix lies in attempting to decipher the secret word. By combining clues obtained from the cards with their own knowledge and intuition, players can risk their guesses by typing the word into the provided fields. Each incorrect attempt results in a small penalty of 2 points, encouraging players to be precise in their choices."
        },
        "4": {
          "title": "Advancing to the Next Level",
          "text": "Victory in Zignix is not just a matter of discovering secret words, but also of progressing through the levels of the game. By correctly guessing the secret word, players ascend to the next level, where more complex challenges and harder words await them. It's a journey of continuous growth and overcoming."
        },
        "5": {
          "title": "Maximizing Points",
          "text": "In Zignix, accumulating points is essential for success. Each won match adds points to the player's Total Points, reflecting their ability to solve the presented puzzles. Furthermore, efficiently using the available clues can minimize point loss, allowing players to achieve higher scores over time."
        },
        "6": {
          "title": "Deciphering Strategies",
          "text": "Deciphering a secret word in Zignix requires more than simply typing random letters into the fields. Players need to employ smart strategies, such as identifying patterns in the provided clues and making effective use of their linguistic knowledge. Those who can think analytically and creatively have a significant advantage."
        },
        "7": {
          "title": "Overcoming Increasing Challenges",
          "text": "As players progress through the levels of Zignix, they are faced with increasingly challenging secret words. This gradual progression of difficulty keeps the game exciting and engaging, encouraging players to continue refining their skills and linguistic knowledge."
        },
        "8": {
          "title": "The Importance of Accuracy",
          "text": "In Zignix, accuracy is paramount. Every attempt to guess the secret word must be carefully considered, as errors result in point penalties. Players are challenged to balance the desire to take risks with the need to be accurate, creating an exciting and strategic gaming experience."
        },
        "9": {
          "title": "Celebrating Achievements",
          "text": "In Zignix, every victory is a achievement to be celebrated. As players advance through the levels, overcome challenges, and accumulate points, they have the opportunity to feel a sense of accomplishment and progress. The journey through the world of secret words is filled with exciting and rewarding moments, making each match a memorable experience."
        },
        "10": {
          "title": "Score Chart",
          "text": "Our game features a dynamic chart that displays the scores achieved in the last 10 levels by the player. This chart provides a clear view of the player's recent achievements, allowing them to track their progress over time. Each point on the chart represents the score achieved at a particular level, offering a clear representation of the player's performance and highlighting areas for improvement or ongoing success. We use this feature to motivate players, encouraging them to surpass their own records and improve their skills throughout the game."
        },
        "11": {
          "title": "Restart Game",
          "text": "On the homepage, we provide a restart button that allows players to restart their journey in Zignix. Clicking on this button resets the game, and the player is presented with new secret words to decipher, providing a refreshed and challenging experience. This functionality is especially useful for players who want to start anew or for those who wish to experience the process of deciphering secret words again without losing the history of their points or previous levels."
        }
      }
    },
    "metaData": {
      "pages": {
        "home": {
          "title": "Zignix | Dashboard"
        },
        "game": {
          "title": "Play"
        },
        "rules": {
          "title": "Rules"
        }
      }
    }
  }
}
