{
  "i18n": {
    "commom": {
      "menuOptions": {
        "home": { "text": "Panel", "link": "/" },
        "game": { "text": "Jugar", "link": "/game" },
        "about": { "text": "Reglas", "link": "/rules" }
      },
      "footer": {
        "copyrightText": "Todos los derechos reservados."
      }
    },
    "home": {
      "gameBanner": {
        "title": "Zignix",
        "subtitle": "¿Aceptarás el desafío?",
        "text": "Un juego hecho para poner a prueba tu inteligencia. Descubre la palabra secreta con la menor cantidad de pistas posible.",
        "buttonText": "Jugar ahora"
      },
      "gameSummary": {
        "summaryTitle": "Resumen del juego",
        "resetLevelButtonText": "Reiniciar el juego",
        "resetModalTitle": "¿Estás seguro que quieres reiniciar el juego?",
        "resetModalSubtitle": "Esta acción hará que pierdas todo el progreso del juego guardado.",
        "resetModalButtonReset": "Reiniciar",
        "resetModalButtonCancel": "Cancelar"
      },
      "doubtBanner": {
        "title": "Accede a la Guía Completa",
        "subtitle": "y aprende todo sobre el juego"
      }
    },
    "game": {
      "playerLevelText": "Nivel",
      "matchPointsText": "Puntos de partido",
      "totalPointsText": "Total de puntos",
      "inputTitle": "Palabra secreta:",
      "inputClearButtonText": "Limpiar",
      "inputVerifyButtonText": "Comprobar palabra",
      "inputVerifyButtonLoadingText": "Comprobando palabra",
      "cluesTitle": "Pistas:",
      "cluesDescription": "Perderás 6.5 puntos por cada pista utilizada.",
      "skipLevel": "Saltar nivel",
      "skipLevelDescription": "Cuando te saltes un nivel, perderás 20 puntos de tu Total de Puntos.",
      "popupNextLevel": "¡Felicitaciones, entendiste bien la palabra secreta '%1' y pasaste al nivel %2!",
      "popupWrongSecretWord": "¡Te equivocaste con la palabra secreta!",
      "gameOver": {
        "gameOverTitle": "¡Felicitaciones,",
        "gameOverSubtitle": "has conquistado todas las etapas del juego!",
        "gameOverText": "Demostraste habilidad y destreza al completar cada desafío. ¡Pero la diversión no tiene por qué terminar aquí! Reinicia el juego para embarcarte en una experiencia completamente única. Con nuevas etapas y desafíos, tendrás la oportunidad de poner a prueba tus habilidades de maneras aún más emocionantes. ¡Prepárate para explorar nuevas pistas, enfrentar nuevos desafíos y sumergirte en una aventura renovada! Estamos emocionados de ver hasta dónde puedes llegar. ¡Buena suerte y diviertete!",
        "gameOverResetButtonText": "Empezar con nuevas etapas"
      }
    },
    "rules": {
      "title": "Guía Completa",
      "ruleList": {
        "1": {
          "title": "Comenzando el Juego",
          "text": "En Zignix, el viaje comienza en el nivel 1, donde los jugadores son introducidos al desafío de descifrar palabras secretas. Al entrar en la página del juego, son recibidos con una serie de campos, cada uno representando una letra de la palabra secreta. Con 100 puntos iniciales disponibles, los jugadores están listos para enfrentar el misterio que les espera."
        },
        "2": {
          "title": "Explorando las Pistas",
          "text": "Dentro de Zignix, los jugadores tienen acceso a 16 cartas misteriosas, cada una guardando una pista crucial para desentrañar la palabra secreta. Cada elección de carta implica una pérdida de 6.5 puntos de los puntos iniciales, por lo que la estrategia es esencial para elegir sabiamente."
        },
        "3": {
          "title": "Descifrando la Palabra Secreta",
          "text": "El desafío principal de Zignix radica en intentar descifrar la palabra secreta. Combinando pistas obtenidas de las cartas con su propio conocimiento e intuición, los jugadores pueden arriesgar sus suposiciones escribiendo la palabra en los campos proporcionados. Cada intento incorrecto resulta en una pequeña penalización de 2 puntos, lo que incentiva a los jugadores a ser precisos en sus elecciones."
        },
        "4": {
          "title": "Avanzando al Siguiente Nivel",
          "text": "La victoria en Zignix no es solo cuestión de descubrir palabras secretas, sino también de avanzar a través de los niveles del juego. Al adivinar correctamente la palabra secreta, los jugadores ascienden al siguiente nivel, donde les esperan desafíos más complejos y palabras más difíciles. Es un viaje de crecimiento y superación continua."
        },
        "5": {
          "title": "Maximizando los Puntos",
          "text": "En Zignix, acumular puntos es esencial para el éxito. Cada partida ganada suma puntos al Total de puntos del jugador, reflejando su capacidad para resolver los enigmas presentados. Además, utilizar eficientemente las pistas disponibles puede minimizar la pérdida de puntos, permitiendo que los jugadores obtengan puntajes más altos con el tiempo."
        },
        "6": {
          "title": "Estrategias de Descifrado",
          "text": "Descifrar una palabra secreta en Zignix requiere más que simplemente escribir letras al azar en los campos. Los jugadores deben emplear estrategias inteligentes, como identificar patrones en las pistas proporcionadas y hacer un uso efectivo de su conocimiento lingüístico. Aquellos que pueden pensar de manera analítica y creativa tienen una ventaja significativa."
        },
        "7": {
          "title": "Superando Desafíos Crecientes",
          "text": "A medida que los jugadores avanzan en los niveles de Zignix, se enfrentan a palabras secretas cada vez más desafiantes. Esta progresión gradual de dificultad mantiene el juego emocionante y envolvente, alentando a los jugadores a continuar mejorando sus habilidades y conocimientos lingüísticos."
        },
        "8": {
          "title": "La Importancia de la Precisión",
          "text": "En Zignix, la precisión es fundamental. Cada intento de adivinar la palabra secreta debe ser cuidadosamente considerado, ya que los errores resultan en penalizaciones de puntos. Los jugadores se enfrentan al desafío de equilibrar el deseo de correr riesgos con la necesidad de ser precisos, creando una experiencia de juego emocionante y estratégica."
        },
        "9": {
          "title": "Celebrando los Logros",
          "text": "En Zignix, cada victoria es un logro que debe ser celebrado. A medida que los jugadores avanzan en los niveles, superan desafíos y acumulan puntos, tienen la oportunidad de sentir un sentido de logro y progreso. El viaje a través del mundo de las palabras secretas está lleno de momentos emocionantes y gratificantes, haciendo que cada partida sea una experiencia memorable."
        },
        "10": {
          "title": "Gráfico de Puntuaciones",
          "text": "Nuestro juego presenta un gráfico dinámico que muestra las puntuaciones alcanzadas en los últimos 10 niveles por el jugador. Este gráfico proporciona una vista clara de los logros recientes del jugador, permitiéndole hacer un seguimiento de su progreso a lo largo del tiempo. Cada punto en el gráfico representa la puntuación alcanzada en un nivel específico, ofreciendo una representación clara del rendimiento del jugador y resaltando áreas de mejora o éxito continuo. Utilizamos esta función para motivar a los jugadores, animándolos a superar sus propios récords y mejorar sus habilidades a lo largo del juego."
        },
        "11": {
          "title": "Reiniciar Juego",
          "text": "En la página de inicio, proporcionamos un botón de reinicio que permite a los jugadores reiniciar su viaje en Zignix. Al hacer clic en este botón, el juego se reinicia y se presentan al jugador nuevas palabras secretas para descifrar, lo que proporciona una experiencia renovada y desafiante. Esta funcionalidad es especialmente útil para los jugadores que desean comenzar de nuevo o para aquellos que desean experimentar nuevamente el proceso de descifrar palabras secretas sin perder el historial de sus puntos o niveles anteriores."
        }
      }
    },
    "metaData": {
      "pages": {
        "home": {
          "title": "Zignix | Desentraña acertijos y sumérgete en una aventura de palabras"
        },
        "game": {
          "title": "Jugar"
        },
        "rules": {
          "title": "Reglas"
        }
      }
    }
  }
}
